package com.green.javaHome.sty;

public interface Ex02 {
    //인터페이스는 추상메서드의 집합.
//    구현된 것이 전혀 없는 설계도. 껍데기(모든 멤버가 public)
    // 인터페이스의 추상메스드 몸통{}만들기 <= 인테페이스 구현
//    미완성 설계도완성하기
    //인터페이스도 구현 클래스의 부모가 될 수 있다.
//    다중상속의문제를 해결 할 수 있다.
//    unit u = new Fighter();
//    Fightable f = new Fighter(); 이렇게 사용이 가능하다
//    인터페스를 메서드의 리턴타입으로 지정할 수 있다.
// 두 대상(객체) 간의 연결,대화,소통을 돕는 중간 역할을 한다.
//    선언(설계)와 구현을 분리 시킬 수 있게 한다.
// 개발 시간을 단축할 수 있다.
//  변경에 유리한 유연한 설계가 가능하다.
//  표준화가 가능하다.
//  서로 관계없는 클래스들을 관계를 맺어줄 수 있다.
//
}
